app/Views/terima_kerja/V_terima_kerja.php

SELECT *
FROM `detail_pekerjaan`
WHERE `id_pencaker` = '4'
---

        <?php
        $db   = \Config\Database::connect();
        $ker = $db->table('detail_pekerjaan')->getWhere(array('id_pencaker' => $biodata->id_pencaker))->getRow();