app/Controllers/C_pencaker.php

    public function index()
    {
        $db   = \Config\Database::connect();
        $data['judul_halaman'] = 'Data Pencaker';
        $tgl_awal = $this->request->getPost('tgl_awal');
        $tgl_akhir = $this->request->getPost('tgl_akhir');
        if ($tgl_awal == "" && $tgl_akhir == "") {
            $data['data'] = $db->table('pencaker')->select('*,pencaker.id as id_pencaker')
                ->join('kecamatan', 'kecamatan.id=pencaker.kecamatan', 'left')
                ->join('nagari', 'nagari.id=pencaker.nagari', 'left')
                ->get()->getResult();
---
SELECT *, `pencaker`.`id` as `id_pencaker`
FROM `pencaker`
LEFT JOIN `kecamatan` ON `kecamatan`.`id`=`pencaker`.`kecamatan`
LEFT JOIN `nagari` ON `nagari`.`id`=`pencaker`.`nagari`

    public function detail($id = "")
    {
        $db   = \Config\Database::connect();

        $data['judul_halaman'] = 'Data Pencaker';
        $data['biodata'] = $db->table('pencaker')->select('*,pencaker.id as id_pencaker')
            ->join('kecamatan', 'kecamatan.id=pencaker.kecamatan', 'left')
            ->join('nagari', 'nagari.id=pencaker.nagari', 'left')
            ->where('pencaker.id',  $id)
            ->get()->getRow();
        $data['kerja'] = $db->table('detail_pekerjaan')->select('*')
            ->where('id_pencaker',  $id)
            ->orderBy('tanggal', 'desc')
            ->get()->getResult();
        $data['berkas'] = $db->table('berkas_pencaker')->getWhere(array('id_pencaker' => $id))->getRow();
        $data['pengajuan'] = $db->table('pengajuan_ak1')->getWhere(array('id_pencaker' => $id))->getRow();
---
SELECT *, `pencaker`.`id` as `id_pencaker`
FROM `pencaker`
LEFT JOIN `kecamatan` ON `kecamatan`.`id`=`pencaker`.`kecamatan`
LEFT JOIN `nagari` ON `nagari`.`id`=`pencaker`.`nagari`
WHERE `pencaker`.`id` = '2'
SELECT *
FROM `detail_pekerjaan`
WHERE `id_pencaker` = '2'
ORDER BY `tanggal` DESC
SELECT *
FROM `berkas_pencaker`
WHERE `id_pencaker` = '2'
SELECT *
FROM `pengajuan_ak1`
WHERE `id_pencaker` = '2'