app/Controllers/C_terima_kerja.php

    public function index()
    {
        $db   = \Config\Database::connect();
        $session = session();

        $data['judul_halaman'] = 'Input Terima Kerja';
        $data['biodata'] = $db->table('pencaker')->select('*,pencaker.id as id_pencaker')
            ->join('kecamatan', 'kecamatan.id=pencaker.kecamatan', 'left')
            ->join('nagari', 'nagari.id=pencaker.nagari', 'left')
            ->where('pencaker.id',  $session->get('id'))
            ->get()->getRow();
        $data['kerja'] = $db->table('detail_pekerjaan')->select('*')
            ->where('id_pencaker',  $session->get('id'))
            ->orderBy('tanggal', 'desc')
            ->get()->getResult();
---
SELECT *, `pencaker`.`id` as `id_pencaker`
FROM `pencaker`
LEFT JOIN `kecamatan` ON `kecamatan`.`id`=`pencaker`.`kecamatan`
LEFT JOIN `nagari` ON `nagari`.`id`=`pencaker`.`nagari`
WHERE `pencaker`.`id` = '4'
SELECT *
FROM `detail_pekerjaan`
WHERE `id_pencaker` = '4'
ORDER BY `tanggal` DESC